flbas1/knob2/lv_micropython/ports/esp32/boards/WAVESHARE_ESP32_S3_KNOB/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Waveshare ESP32-S3-Knob"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3R8"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "esp32-knob"

#define MICROPY_HW_I2C0_SCL                 (12)
#define MICROPY_HW_I2C0_SDA                 (11)

#define MICROPY_HW_I2C1_SCL                 (1)
#define MICROPY_HW_I2C1_SDA                 (2)

#define MICROPY_HW_SPI1_MOSI                (35)
#define MICROPY_HW_SPI1_MISO                (37)
#define MICROPY_HW_SPI1_SCK                 (36)
